#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results output :colnames yes :session *R:function*

** body

#+begin_src R
add <- function(a, b) a + b
body(add)
#+end_src

#+RESULTS:
:
: a
: b

- body は call class
#+begin_src R
body(add) %>% class()
#+end_src

#+RESULTS:
: [1] "call"

- 関数を書き換えられる
#+begin_src R
body(add) <- expression(a + b + 10)
add(1, 2)
#+end_src

#+RESULTS:
:
: [1] 13

** arguments (formals)

#+begin_src R
add <- function(a, b) a + b
formals(add)
#+end_src

#+RESULTS:
:
: $a
:
:
: $b

- formals = pairlist class
#+begin_src R
formals(add) %>% class()
#+end_src

#+RESULTS:
: [1] "pairlist"

** envivronmnet

- 通常インタラクティブに定義した関数は Global_Env に存在する
#+begin_src R
add <- function(a, b) a + b
environment(add)
#+end_src

#+RESULTS:
:
: <environment: R_GlobalEnv>

#+begin_src R
is.function(add)
#+end_src

#+RESULTS:
: [1] TRUE

- base package の全ての関数
#+begin_src R
objs <- mget(ls("package:base"), inherits = TRUE)
funs <- Filter(is.function, objs)
length(funs)
#+end_src

#+RESULTS:
: 
: [1] 1218

* Primitive functions

- 3 つの構成要素がすべて NULL
- C code を直接呼び出している
#+begin_src R
body(sum)
formals(sum)
environment(sum)

is.primitive(sum)
#+end_src

#+RESULTS:
: NULL
:
: NULL
:
: NULL
:
: [1] TRUE

* Every operation is a function call

- Everything that exists is an object.
- Everything that happens is a function call.

#+begin_src R
`+`(10, 13)
#+end_src

#+RESULTS:
: [1] 23


#+begin_src R
`for`(i, 1:2, print(i))
#+end_src

#+RESULTS:
: [1] 1
: [1] 2

#+begin_src R
`if`(i == 1, print("yes!"), print("no."))
#+end_src

#+RESULTS:
: [1] "no."

#+begin_src R
x <- c(1, 2, 3)
`[`(x, 3)
#+end_src

#+RESULTS:
:
: [1] 3

#+begin_src R
`{`(print(1), print(2), print(3))
#+end_src

#+RESULTS:
: [1] 1
: [1] 2
: [1] 3

#+begin_src R
add <- function(x, y) x + y
sapply(1:10, add, 3)
sapply(1:10, `+`, 3)
sapply(1:10, "+", 3) # sapply は関数名が文字列でも OK
#+end_src

#+RESULTS:
:
:  [1]  4  5  6  7  8  9 10 11 12 13
:
:  [1]  4  5  6  7  8  9 10 11 12 13
:
:  [1]  4  5  6  7  8  9 10 11 12 13

* Arguments

- formal arguments
- actual arguments
#+begin_src R
f <- function(abcdef, bcde1, bcde2) {
  list(a = abcdef, b1 = bcde1, b2 = bcde2)
}
#+end_src

- 引数の割当順
   1. by complete name, or by partial name
   2. by prefix matching
   3. by position
#+begin_src R
str(f(1, 2, 3))
str(f(2, 3, abcdef = 1))
str(f(2, 3, a = 1)) # 短縮形でも OK
#+end_src

#+RESULTS:
#+begin_example
List of 3
 $ a : num 1
 $ b1: num 2
 $ b2: num 3

List of 3
 $ a : num 1
 $ b1: num 2
 $ b2: num 3

List of 3
 $ a : num 1
 $ b1: num 2
 $ b2: num 3
#+end_example

- Common rules
  - Use positional matching for the first one or two arguments that they will be the most commonly used,
  - Avoid using positional matching for less commonly used arguments
  - Readable abbreviations with partial matching
  - (Package) Do not use partial matching, and must use complete names
  - Named arguments should always come after unnamed arguments
  - If a function uses ..., you can only specify arguments listed after ... with their full name

* Infix functions

- LHS func RHS の形式のもの
- ユーザー定義のものは、%hoge% の形式にする

- Complete list (pre-defined)
- :, ::, :::, $, @, ^, *, /, +, -, >, >=, <, <=, ==, !=, !, &, &&, |, ||, ~, <-, <<-,
  %% , %*% , %/% , %in% , %o% , %x%

- 定義する際は、`` でかこう
#+begin_src R
`%+%` <- function(a, b) paste0(a, b)
"new" %+% " string"
`%+%`("new", " string")
#+end_src

#+RESULTS:
:
: [1] "new string"
:
: [1] "new string"

- %% の間はどんな文字でもよい (エスケープは必要)
#+begin_src R
`% %` <- function(a, b) paste(a, b)
`%'%` <- function(a, b) paste(a, b)
`%/\\%` <- function(a, b) paste(a, b)

"a" % % "b"
"a" %'% "b"
"a" %/\% "b"
#+end_src

#+RESULTS:
:
: [1] "a b"
:
: [1] "a b"
:
: [1] "a b"

- 左から右につなげていく
#+begin_src R
`%-%` <- function(a, b) paste0("(", a, " %-% ", b, ")")
"a" %-% "b" %-% "c"
#+end_src

#+RESULTS:
:
: [1] "((a %-% b) %-% c)"

- %||% Default value for NULL
#+begin_src R
1 %||% 2
NULL %||% 2
#+end_src

#+RESULTS:
: [1] 1
:
: [1] 2

